/**
 * Данный проект демонстрирует модификаторы доступа:
 * <ul>
 *    <li>private - доступ только из текущего класса;</li>
 *    <li>protected - доступ для класса и его потомков;</li>
 *    <li>пакетный доступ - никак не обозначается (отсутствие модификатора). Класс недоступен вне пакета и
 *    доступен всем членам пакета;</li>
 *    <li>public - доступ для любых классов в любых пакетах.</li>
 * </ul>
 *
 * <b>Используютс также модификаторы:</b>
 * <ul>
 *     <li><code>final</code> - поле или метод не подлежащие дальнейшим изменениям;</li>
 *     <li>static - поле или метод единое для всех экземпляторв класса (много автомобилей, одна бензоколонка);</li>
 *     <li>abstract - частичное описание класса; полная реализация будет выполнена в потомках;
 *     абстрактный класс нельзя превратить в инстанс.</li>
 * </ul>
 */